TensorizedNet(
  (dropout): Dropout(p=0.5, inplace=False)
  (fc1): TensorizedLinear(
    in_features=784, out_features=512, bias=True
    (tensor): CP(
      (trainable_variables): ParameterList(
          (0): Parameter containing: [torch.cuda.FloatTensor of size 28x10 (GPU 0)]
          (1): Parameter containing: [torch.cuda.FloatTensor of size 28x10 (GPU 0)]
          (2): Parameter containing: [torch.cuda.FloatTensor of size 16x10 (GPU 0)]
          (3): Parameter containing: [torch.cuda.FloatTensor of size 32x10 (GPU 0)]
          (4): Parameter containing: [torch.cuda.FloatTensor of size 28x10 (GPU 0)]
          (5): Parameter containing: [torch.cuda.FloatTensor of size 28x10 (GPU 0)]
          (6): Parameter containing: [torch.cuda.FloatTensor of size 16x10 (GPU 0)]
          (7): Parameter containing: [torch.cuda.FloatTensor of size 32x10 (GPU 0)]
          (8): Parameter containing: [torch.cuda.FloatTensor of size 1x10 (GPU 0)]
      )
    )
  )
  (fc2): TensorizedLinear(
    in_features=512, out_features=10, bias=True
    (tensor): CP(
      (trainable_variables): ParameterList(
          (0): Parameter containing: [torch.cuda.FloatTensor of size 32x10 (GPU 0)]
          (1): Parameter containing: [torch.cuda.FloatTensor of size 16x10 (GPU 0)]
          (2): Parameter containing: [torch.cuda.FloatTensor of size 10x10 (GPU 0)]
          (3): Parameter containing: [torch.cuda.FloatTensor of size 32x10 (GPU 0)]
          (4): Parameter containing: [torch.cuda.FloatTensor of size 16x10 (GPU 0)]
          (5): Parameter containing: [torch.cuda.FloatTensor of size 10x10 (GPU 0)]
          (6): Parameter containing: [torch.cuda.FloatTensor of size 1x10 (GPU 0)]
      )
    )
  )
  (relu): ReLU()
)
Train Epoch: 1 [0/60000 (0%)]	Loss: 3.372968
Epoch time 8.98

Test set: Average loss: 1.3487, Accuracy: 6221/10000 (62%)

Train Epoch: 2 [0/60000 (0%)]	Loss: 1.675520
Epoch time 9.47

Test set: Average loss: 0.7519, Accuracy: 7928/10000 (79%)

******Tensor Ranks*******
10
10
******Tensor Ranks*******
