TensorizedNet(
  (dropout): Dropout(p=0.5, inplace=False)
  (fc1): TensorizedLinear(
    in_features=784, out_features=512, bias=True
    (tensor): Tucker(
      (trainable_variables): ParameterList(
          (0): Parameter containing: [torch.cuda.FloatTensor of size 10x10x10x10 (GPU 0)]
          (1): Parameter containing: [torch.cuda.FloatTensor of size 28x10 (GPU 0)]
          (2): Parameter containing: [torch.cuda.FloatTensor of size 28x10 (GPU 0)]
          (3): Parameter containing: [torch.cuda.FloatTensor of size 16x10 (GPU 0)]
          (4): Parameter containing: [torch.cuda.FloatTensor of size 32x10 (GPU 0)]
          (5): Parameter containing: [torch.cuda.FloatTensor of size 10x10x10x10 (GPU 0)]
          (6): Parameter containing: [torch.cuda.FloatTensor of size 28x10 (GPU 0)]
          (7): Parameter containing: [torch.cuda.FloatTensor of size 28x10 (GPU 0)]
          (8): Parameter containing: [torch.cuda.FloatTensor of size 16x10 (GPU 0)]
          (9): Parameter containing: [torch.cuda.FloatTensor of size 32x10 (GPU 0)]
          (10): Parameter containing: [torch.cuda.FloatTensor of size 10 (GPU 0)]
          (11): Parameter containing: [torch.cuda.FloatTensor of size 10 (GPU 0)]
          (12): Parameter containing: [torch.cuda.FloatTensor of size 10 (GPU 0)]
          (13): Parameter containing: [torch.cuda.FloatTensor of size 10 (GPU 0)]
      )
    )
  )
  (fc2): TensorizedLinear(
    in_features=512, out_features=10, bias=True
    (tensor): Tucker(
      (trainable_variables): ParameterList(
          (0): Parameter containing: [torch.cuda.FloatTensor of size 10x10x10 (GPU 0)]
          (1): Parameter containing: [torch.cuda.FloatTensor of size 32x10 (GPU 0)]
          (2): Parameter containing: [torch.cuda.FloatTensor of size 16x10 (GPU 0)]
          (3): Parameter containing: [torch.cuda.FloatTensor of size 10x10 (GPU 0)]
          (4): Parameter containing: [torch.cuda.FloatTensor of size 10x10x10 (GPU 0)]
          (5): Parameter containing: [torch.cuda.FloatTensor of size 32x10 (GPU 0)]
          (6): Parameter containing: [torch.cuda.FloatTensor of size 16x10 (GPU 0)]
          (7): Parameter containing: [torch.cuda.FloatTensor of size 10x10 (GPU 0)]
          (8): Parameter containing: [torch.cuda.FloatTensor of size 10 (GPU 0)]
          (9): Parameter containing: [torch.cuda.FloatTensor of size 10 (GPU 0)]
          (10): Parameter containing: [torch.cuda.FloatTensor of size 10 (GPU 0)]
      )
    )
  )
  (relu): ReLU()
)
